In [1]:
import pandas as pd
import numpy as np
a1 = [60, 84, 80, 70, "문예부"]
a2 = [77, 62, 95, 85, "과학부"]
a3 = [61, 97, 72, np.nan, "농구부"]
a4 = [75, 65, 95, np.nan, "다도부"]
cols = ["국어", "영어", "수학", "과학", "소속"]
b1 = ["문예부", "과학부", "다도부"]
df = pd.DataFrame([a1, a2, a3, a4], index=list("ABCD"), columns=cols)

In [2]:
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [4]:
s1 = ["B", "D"]
df.loc[s1]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [12]:
s1 = [False, True, False, True, True]
df.loc[:, s1]

   영어    과학   소속
A  84  70.0  문예부
B  62  85.0  과학부
C  97   NaN  농구부
D  65   NaN  다도부

In [13]:
df["수학"] > 90

A    False
B     True
C    False
D     True
Name: 수학, dtype: bool

In [14]:
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [18]:
df.loc[df["영어"] > 80, "국어":"과학"]

   국어  영어  수학    과학
A  60  84  80  70.0
C  61  97  72   NaN

In [19]:
cond1 = df["영어"] > 80  # 변수로 지정하는 연습을 해야함
df.loc[cond1, "국어":"과학"]

   국어  영어  수학    과학
A  60  84  80  70.0
C  61  97  72   NaN

In [24]:
cond1 = df["국어"] > 60
cond2 = df["수학"] > 75
df.loc[cond1 & cond2]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

- isnell: NaN이면 True로 아니면 False로 반환하는 함수

In [25]:
df["과학"].isnull()

A    False
B    False
C     True
D     True
Name: 과학, dtype: bool

In [26]:
df.loc[df["과학"].isnull()]

   국어  영어  수학  과학   소속
C  61  97  72 NaN  농구부
D  75  65  95 NaN  다도부

In [27]:
df.loc[~df["과학"].isnull()] # ~ isnull의 반대 (NaN이 아닌 데이터만 추출)

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부

In [32]:
df.loc[(~df["과학"].isnull()) | (df["수학"] > 90)] # | or 조건일때 () 소괄호로 감싸 줘야 함

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [33]:
df.loc[df["소속"] != "농구부"]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [34]:
cond1 = df["소속"] == "문예부"
cond2 = df["소속"] == "과학부"
cond3 = df["소속"] == "다도부"
df[cond1 | cond2 | cond3]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

- isin 함수를 이용해 문예부와 과학부와 다도부의 데이터만 추출하라

In [35]:
b1

['문예부', '과학부', '다도부']

In [36]:
df["소속"].isin(b1)

A     True
B     True
C    False
D     True
Name: 소속, dtype: bool

In [37]:
df.loc[df["소속"].isin(b1)] # boolean indexing

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부